# Pandas

Pandas is a package used for managing data.

Pandas main use is that it creates 2 new data types for storing data: series and dataframe.

Think of a pandas dataframe like an excel spreadsheet that is storing some data.  One column can have customer name, one column can have product sold name, another column can have price or quantity... Then the rows could be individual sales.

A dataframe is made up of several series.  Each column of a dataframe is a series.

We can name each column and row of a dataframe.

A pandas dataframe is very similar to a data.frame in R.

Similar to numpy arrays, a dataframe is a more robust data type for storing data than lists of lists. Dataframes are more flexible than numpy arrays.

A numpy array can create a matrix with all entries of the same data type.  In a dataframe each column can have its own datatype.  

That's not to say numpy arrays aren't useful.  It is often easiest to convert some subset of a dataframe to a numpy array and then use that to do some math.

Pandas also has SQL-like functions for merging, joining, and sorting dataframes.

In [176]:
import pandas as pd
import numpy as np
# see pandas documentation of series and dataframe convert to python code usefull datatypes

# csv

In [177]:
df1 = pd.read_csv('files/supermarkets.csv')
df1["City"]# or df1.City

0    San Francisco
1    San Francisco
2    San Francisco
3    San Francisco
4    San Francisco
5    San Francisco
Name: City, dtype: object

# xlsx

In [178]:
df2 = pd.read_excel('files/supermarkets.xlsx', sheet_name=0)
df2.head()

,ID,Address,City,State,Country,Supermarket Name,Number of Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

# json

In [179]:
df3 = pd.read_json('files/supermarkets.json')
df3.head()

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

# txt

In [180]:
df4 = pd.read_csv('files/supermarkets-commas.txt')
df4.head()

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

# semi-colon

In [181]:
df5 = pd.read_csv('files/supermarkets-semi-colons.txt', sep=';') # sep or delimiter
df5.head()

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

# csv no-header

In [182]:
df6 = pd.read_csv('files/supermarkets-header.txt', header=None)
df6.head()

   0                1              2                 3    4            5   6
0  1     3666 21st St  San Francisco          CA 94114  USA      Madeira   8
1  2   735 Dolores St  San Francisco          CA 94119  USA  Bready Shop  15
2  3      332 Hill St  San Francisco  California 94114  USA  Super River  25
3  4     3995 23rd St  San Francisco          CA 94114  USA   Ben's Shop  10
4  5  1056 Sanchez St  San Francisco        California  USA      Sanchez  12

In [183]:
df6.columns = ['Id', 'Address', 'City', 'Zip', 'Country', 'Name', 'Employees']
df6.head()

,Id,Address,City,Zip,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

# indexing and slicing

In [184]:
df6.loc[:,'Name'] # or df6.Name

0        Madeira
1    Bready Shop
2    Super River
3     Ben's Shop
4        Sanchez
5     Richvalley
Name: Name, dtype: object

In [185]:
df6.loc[[0,1],['Zip','Name']]

        Zip         Name
0  CA 94114      Madeira
1  CA 94119  Bready Shop

In [186]:
df6.Employees[df6.Employees>20]

2    25
Name: Employees, dtype: int64

In [187]:
df6.iloc[2]

Id                          3
Address           332 Hill St
City            San Francisco
Zip          California 94114
Country                   USA
Name              Super River
Employees                  25
Name: 2, dtype: object

In [188]:
df6.iloc[1:3,2:4] # either row or column is alos possible

            City               Zip
1  San Francisco          CA 94119
2  San Francisco  California 94114

# deleting columns and rows

In [189]:
# delete column
df6.drop('City',axis=1,inplace=True)
df6.head()

   Id          Address               Zip Country         Name  Employees
0   1     3666 21st St          CA 94114     USA      Madeira          8
1   2   735 Dolores St          CA 94119     USA  Bready Shop         15
2   3      332 Hill St  California 94114     USA  Super River         25
3   4     3995 23rd St          CA 94114     USA   Ben's Shop         10
4   5  1056 Sanchez St        California     USA      Sanchez         12

In [204]:
# delte row
df6.drop(1,axis=0)
df6

,Id,Address,Zip,Country,Name,Employees,salary,continent,City,rand
0,1,3666 21st St,CA 94114,USA,Madeira,8.0,2000,NaN,NaN,1.258322
1,2,735 Dolores St,CA 94119,USA,Bready Shop,15.0,3000,NaN,NaN,2.521560
2,3,332 Hill St,California 94114,USA,Super River,25.0,2000,NaN,NaN,-0.030013
3,4,3995 23rd St,CA 94114,USA,Ben's Shop,10.0,3000,NaN,NaN,0.078529
4,5,1056 Sanchez St,California,USA,Sanchez,12.0,3000,NaN,NaN,0.289311
5,6,551 Alvarado St,CA 94114,USA,Richvalley,20.0,3000,NaN,NaN,-0.017337
6,99,bhaktapur,44800,NEpal,rabin,NaN,45678,"NEpal , Kathmandu",Kathmandu,-1.108075

In [190]:
df6.drop(df6.columns[0:3],1)

  Country         Name  Employees
0     USA      Madeira          8
1     USA  Bready Shop         15
2     USA  Super River         25
3     USA   Ben's Shop         10
4     USA      Sanchez         12
5     USA   Richvalley         20

In [191]:
df6.columns

Index(['Id', 'Address', 'Zip', 'Country', 'Name', 'Employees'], dtype='object')

# updating and adding columns and rows

In [192]:
df6

   Id          Address               Zip Country         Name  Employees
0   1     3666 21st St          CA 94114     USA      Madeira          8
1   2   735 Dolores St          CA 94119     USA  Bready Shop         15
2   3      332 Hill St  California 94114     USA  Super River         25
3   4     3995 23rd St          CA 94114     USA   Ben's Shop         10
4   5  1056 Sanchez St        California     USA      Sanchez         12
5   6  551 Alvarado St          CA 94114     USA   Richvalley         20

In [193]:
df6['salary'] = [2000, 3000, 2000, 3000, 3000, 3000] # add columns
df6['continent'] = df6.shape[0]*['asia'] # add columns
new_row = {"Id":99, 'Address':'bhaktapur', 'City':'Kathmandu', 'Zip':44800, 'Country':'NEpal', 'Name':"rabin", 'salary':"45678", 'continent':'Asia'}
df6 = df6.append(new_row, ignore_index=True)
df6.head()

,Id,Address,Zip,Country,Name,Employees,salary,continent,City
0,1,3666 21st St,CA 94114,USA,Madeira,8.0,2000,asia,NaN
1,2,735 Dolores St,CA 94119,USA,Bready Shop,15.0,3000,asia,NaN
2,3,332 Hill St,California 94114,USA,Super River,25.0,2000,asia,NaN
3,4,3995 23rd St,CA 94114,USA,Ben's Shop,10.0,3000,asia,NaN
4,5,1056 Sanchez St,California,USA,Sanchez,12.0,3000,asia,NaN

In [194]:
df6['rand'] = np.random.randn(7,1)
df6.head()

,Id,Address,Zip,Country,Name,Employees,salary,continent,City,rand
0,1,3666 21st St,CA 94114,USA,Madeira,8.0,2000,asia,NaN,1.258322
1,2,735 Dolores St,CA 94119,USA,Bready Shop,15.0,3000,asia,NaN,2.521560
2,3,332 Hill St,California 94114,USA,Super River,25.0,2000,asia,NaN,-0.030013
3,4,3995 23rd St,CA 94114,USA,Ben's Shop,10.0,3000,asia,NaN,0.078529
4,5,1056 Sanchez St,California,USA,Sanchez,12.0,3000,asia,NaN,0.289311

In [195]:
df6['continent'] = df6['Country'] + " , " + df6['City']

In [196]:
df6

,Id,Address,Zip,Country,Name,Employees,salary,continent,City,rand
0,1,3666 21st St,CA 94114,USA,Madeira,8.0,2000,NaN,NaN,1.258322
1,2,735 Dolores St,CA 94119,USA,Bready Shop,15.0,3000,NaN,NaN,2.521560
2,3,332 Hill St,California 94114,USA,Super River,25.0,2000,NaN,NaN,-0.030013
3,4,3995 23rd St,CA 94114,USA,Ben's Shop,10.0,3000,NaN,NaN,0.078529
4,5,1056 Sanchez St,California,USA,Sanchez,12.0,3000,NaN,NaN,0.289311
5,6,551 Alvarado St,CA 94114,USA,Richvalley,20.0,3000,NaN,NaN,-0.017337
6,99,bhaktapur,44800,NEpal,rabin,NaN,45678,"NEpal , Kathmandu",Kathmandu,-1.108075

# transpose

In [197]:
df6_t = df6.T
df6_t.head()

,0,1,2,3,4,5,6
Id,1,2,3,4,5,6,99
Address,3666 21st St,735 Dolores St,332 Hill St,3995 23rd St,1056 Sanchez St,551 Alvarado St,bhaktapur
Zip,CA 94114,CA 94119,California 94114,CA 94114,California,CA 94114,44800
Country,USA,USA,USA,USA,USA,USA,NEpal
Name,Madeira,Bready Shop,Super River,Ben's Shop,Sanchez,Richvalley,rabin

# Creating series and dataframe

In [198]:
# lets give labels to rows and columns
df3 = pd.DataFrame(np.random.randn(5,5),index=['first row','second row','third row','fourth row','fifth row'],
                   columns=['first col','second col','third col','fourth col','fifth col'])
df3

            first col  second col  third col  fourth col  fifth col
first row   -0.093930   -0.257575   0.904745    0.269849   0.562162
second row  -0.491927    0.210404  -1.547038   -0.245236   0.407401
third row    1.626646   -0.105868   0.286684    1.008407  -0.590546
fourth row   0.551932   -1.051985   0.400754   -0.436150  -1.238142
fifth row   -0.569878   -1.163893   0.473728   -0.350643  -1.015512

In [199]:
df3[['third col','first col']]

            third col  first col
first row    0.904745  -0.093930
second row  -1.547038  -0.491927
third row    0.286684   1.626646
fourth row   0.400754   0.551932
fifth row    0.473728  -0.569878

In [200]:
mylist = [5.4,6.1,1.7,99.8]
myseries2 = pd.Series(data=mylist)
print(myseries2)
# we can add labels to the entries of a series

mylabels = ['first','second','third','fourth']
myseries3 = pd.Series(mylist,mylabels)
print(myseries3)

0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64
first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [201]:
# we can do math on series 
myseries5 = pd.Series([5.5,1.1,8.8,1.6,99],['fifth','sixth','seventh','eighth','ninth'])

print(myseries5)

fifth       5.5
sixth       1.1
seventh     8.8
eighth      1.6
ninth      99.0
dtype: float64

# Combining data frames

The ways dataframes are combined in pandas is similar to SQL

We will examine 3 methods for combining dataframes

1. concat
2. join
3. merge

In [205]:
df7 = pd.DataFrame({"customer":['101','102','103','104'], 
                    'category': ['cat2','cat2','cat1','cat3'],
                    'important': ['yes','no','yes','yes'],
                    'sales': [123,52,214,663]},index=[0,1,2,3])

df8 = pd.DataFrame({"customer":['101','103','104','105'], 
                    'color': ['yellow','green','green','blue'],
                    'distance': [12,9,44,21],
                    'sales': [123,214,663,331]},index=[4,5,6,7])

In [206]:
pd.concat([df7,df8],axis=0,sort=False) # concat row wise

  customer category important  sales   color  distance
0      101     cat2       yes    123     NaN       NaN
1      102     cat2        no     52     NaN       NaN
2      103     cat1       yes    214     NaN       NaN
3      104     cat3       yes    663     NaN       NaN
4      101      NaN       NaN    123  yellow      12.0
5      103      NaN       NaN    214   green       9.0
6      104      NaN       NaN    663   green      44.0
7      105      NaN       NaN    331    blue      21.0

In [207]:
pd.concat([df7,df8],axis=1,sort=False) # concat column wise

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes  123.0      NaN     NaN       NaN    NaN
1      102     cat2        no   52.0      NaN     NaN       NaN    NaN
2      103     cat1       yes  214.0      NaN     NaN       NaN    NaN
3      104     cat3       yes  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN      101  yellow      12.0  123.0
5      NaN      NaN       NaN    NaN      103   green       9.0  214.0
6      NaN      NaN       NaN    NaN      104   green      44.0  663.0
7      NaN      NaN       NaN    NaN      105    blue      21.0  331.0

# Merge and Join

Merge combines dataframes using a column's values to identify common entries

Join combines dataframes using the index to identify common entries

In [208]:
pd.merge(df7,df8,how='outer',on='customer') # outer merge is union of on

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow      12.0    123.0
1      102     cat2        no     52.0     NaN       NaN      NaN
2      103     cat1       yes    214.0   green       9.0    214.0
3      104     cat3       yes    663.0   green      44.0    663.0
4      105      NaN       NaN      NaN    blue      21.0    331.0

In [209]:
pd.merge(df7,df8,how='inner',on='customer') # inner merge is intersection of on

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow        12      123
1      103     cat1       yes      214   green         9      214
2      104     cat3       yes      663   green        44      663

In [210]:
pd.merge(df7,df8,how='right',on='customer') # left merge is just first on, but all columns ... right is second

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow        12      123
1      103     cat1       yes    214.0   green         9      214
2      104     cat3       yes    663.0   green        44      663
3      105      NaN       NaN      NaN    blue        21      331

In [211]:
df9 = pd.DataFrame({'Q1': [101,102,103],
                    'Q2': [201,202,203]},
                   index=['I0','I1','I2'])

df10 = pd.DataFrame({'Q3': [301,302,303],
                    'Q4': [401,402,403]},
                   index=['I0','I2','I3'])

In [212]:
# join behaves just like merge, 
# except instead of using the values of one of the columns 
# to combine data frames, it uses the index labels
df9.join(df10,how='right') # outer, inner, left, and right work the same as merge

       Q1     Q2   Q3   Q4
I0  101.0  201.0  301  401
I2  103.0  203.0  302  402
I3    NaN    NaN  303  403

# Functions

In [214]:
def profit(s):
    return s*0.5 # 50% markup...

In [215]:
df8['sales'].apply(profit)

4     61.5
5    107.0
6    331.5
7    165.5
Name: sales, dtype: float64

In [216]:
df8['color'].apply(len)

4    6
5    5
6    5
7    4
Name: color, dtype: int64

In [217]:
df11 = df8[['distance','sales']]
df11.applymap(profit)

   distance  sales
4       6.0   61.5
5       4.5  107.0
6      22.0  331.5
7      10.5  165.5

In [218]:
# if some series has multiple of the same value then we can group all the unique entries together
mydict = {'customer': ['Customer 1','Customer 1','Customer2','Customer2','Customer3','Customer3'], 
          'product1': [1.1,2.1,3.8,4.2,5.5,6.9],
          'product2': [8.2,9.1,11.1,5.2,44.66,983]}
df6 = pd.DataFrame(mydict,index=['Purchase 1','Purchase 2','Purchase 3','Purchase 4','Purchase 5','Purchase 6'])
df6

              customer  product1  product2
Purchase 1  Customer 1       1.1      8.20
Purchase 2  Customer 1       2.1      9.10
Purchase 3   Customer2       3.8     11.10
Purchase 4   Customer2       4.2      5.20
Purchase 5   Customer3       5.5     44.66
Purchase 6   Customer3       6.9    983.00

In [219]:
grouped_data = df6.groupby('customer')
print(grouped_data)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000274CA60FA90>

In [220]:
grouped_data.describe()

           product1                                           product2  \
              count mean       std  min   25%  50%   75%  max    count
customer
Customer 1      2.0  1.6  0.707107  1.1  1.35  1.6  1.85  2.1      2.0
Customer2       2.0  4.0  0.282843  3.8  3.90  4.0  4.10  4.2      2.0
Customer3       2.0  6.2  0.989949  5.5  5.85  6.2  6.55  6.9      2.0


              mean         std    min      25%     50%      75%    max
customer
Customer 1    8.65    0.636396   8.20    8.425    8.65    8.875    9.1
Customer2     8.15    4.171930   5.20    6.675    8.15    9.625   11.1
Customer3   513.83  663.506577  44.66  279.245  513.83  748.415  983.0

In [221]:
grouped_data.std()

            product1    product2
customer
Customer 1  0.707107    0.636396
Customer2   0.282843    4.171930
Customer3   0.989949  663.506577